<details><summary>Show plan for production</summary>

```terraform
Terraform will perform the following actions:

  # module.user_profile.module.java_ecs_service.data.aws_iam_policy_document.appmesh[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "appmesh"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "appmesh:StreamAggregatedResources",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.user_profile.module.java_ecs_service.aws_cloudwatch_log_group.aws_for_fluent_bit_sidecar_log_group will be created
  + resource "aws_cloudwatch_log_group" "aws_for_fluent_bit_sidecar_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "mobile-persistence-aws-for-fluent-bit-sidecar-logs"
      + retention_in_days = 0
      + tags              = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all          = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
    }

  # module.user_profile.module.java_ecs_service.aws_ecs_service.service_ecs_service will be created
  + resource "aws_ecs_service" "service_ecs_service" {
      + cluster                            = "arn:aws:ecs:eu-west-1:090999133015:cluster/production-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "mobile-persistence-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all                           = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-04a0b79470abe20f8",
              + "subnet-07e5c33b3369b65cf",
              + "subnet-08c99efa608f7cdeb",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.user_profile.module.java_ecs_service.aws_ecs_task_definition.service_task_definition will be created
  + resource "aws_ecs_task_definition" "service_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "mobile-persistence"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all                 = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + task_role_arn            = (known after apply)

      + proxy_configuration {
          + container_name = "envoy"
          + properties     = {
              + "AppPorts"         = "8080"
              + "EgressIgnoredIPs" = "169.254.170.2,169.254.169.254"
              + "IgnoredUID"       = "1337"
              + "ProxyEgressPort"  = "15001"
              + "ProxyIngressPort" = "15000"
            }
          + type           = "APPMESH"
        }

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.user_profile.module.java_ecs_service.aws_iam_policy.appmesh[0] will be created
  + resource "aws_iam_policy" "appmesh" {
      + arn         = (known after apply)
      + description = "Allows the task access to specified appmesh node"
      + id          = (known after apply)
      + name        = "mobile-persistence-ecs-appmesh-policy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.user_profile.module.java_ecs_service.aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mobile-persistence-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all              = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.user_profile.module.java_ecs_service.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mobile-persistence-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all              = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.user_profile.module.java_ecs_service.aws_iam_role_policy_attachment.appmesh[0] will be created
  + resource "aws_iam_role_policy_attachment" "appmesh" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "mobile-persistence-task-role"
    }

  # module.user_profile.module.java_ecs_service.aws_iam_role_policy_attachment.execution_role_retrieve_datadog_secret_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "execution_role_retrieve_datadog_secret_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::090999133015:policy/terraform-retrieve-datadog-api-key-secret-policy"
      + role       = "mobile-persistence-task-execution-role"
    }

  # module.user_profile.module.java_ecs_service.aws_iam_role_policy_attachment.task_execution_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "mobile-persistence-task-execution-role"
    }

  # module.user_profile.module.java_ecs_service.aws_service_discovery_service.service_discovery_service[0] will be created
  + resource "aws_service_discovery_service" "service_discovery_service" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "mobile-persistence"
      + namespace_id  = (known after apply)
      + tags          = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all      = {
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }

      + dns_config {
          + namespace_id   = "ns-j3spxujss32v34xv"
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 1
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.user_profile.module.java_ecs_service.module.appmesh[0].aws_appmesh_route.appmesh will be created
  + resource "aws_appmesh_route" "appmesh" {
      + arn                 = (known after apply)
      + created_date        = (known after apply)
      + id                  = (known after apply)
      + last_updated_date   = (known after apply)
      + mesh_name           = "marshmallow"
      + mesh_owner          = "230488382832"
      + name                = "mobile-persistence"
      + resource_owner      = (known after apply)
      + tags_all            = (known after apply)
      + virtual_router_name = "mobile-persistence"

      + spec {

          + http_route {
              + action {
                  + weighted_target {
                      + virtual_node = "mobile-persistence"
                      + weight       = 100
                    }
                }

              + match {
                  + prefix = "/"
                }

              + retry_policy {
                  + http_retry_events = [
                      + "gateway-error",
                      + "stream-error",
                    ]
                  + max_retries       = 2
                  + tcp_retry_events  = [
                      + "connection-error",
                    ]

                  + per_retry_timeout {
                      + unit  = "s"
                      + value = 75
                    }
                }

              + timeout {

                  + per_request {
                      + unit  = "s"
                      + value = 225
                    }
                }
            }
        }
    }

  # module.user_profile.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.appmesh will be created
  + resource "aws_appmesh_virtual_node" "appmesh" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "230488382832"
      + name              = "mobile-persistence"
      + resource_owner    = (known after apply)
      + tags_all          = (known after apply)

      + spec {

          + listener {

              + port_mapping {
                  + port     = 8080
                  + protocol = "http"
                }

              + timeout {

                  + http {

                      + per_request {
                          + unit  = "s"
                          + value = 225
                        }
                    }
                }
            }

          + service_discovery {
              + aws_cloud_map {
                  + namespace_name = "local"
                  + service_name   = "mobile-persistence"
                }
            }
        }
    }

  # module.user_profile.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_router.appmesh will be created
  + resource "aws_appmesh_virtual_router" "appmesh" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "230488382832"
      + name              = "mobile-persistence"
      + resource_owner    = (known after apply)
      + tags_all          = (known after apply)

      + spec {
          + listener {
              + port_mapping {
                  + port     = 8080
                  + protocol = "http"
                }
            }
        }
    }

  # module.user_profile.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_service.appmesh will be created
  + resource "aws_appmesh_virtual_service" "appmesh" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "230488382832"
      + name              = "mobile-persistence.local"
      + resource_owner    = (known after apply)
      + tags_all          = (known after apply)

      + spec {
          + provider {

              + virtual_router {
                  + virtual_router_name = "mobile-persistence"
                }
            }
        }
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mobile-persistence-security-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "mobile-persistence-security-group"
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + tags_all               = {
          + "Name"      = "mobile-persistence-security-group"
          + "Terraform" = "true"
          + "service"   = "mobile-persistence"
        }
      + vpc_id                 = "vpc-08c2ab7b7b894be17"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress Rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.15.6.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.15.7.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.15.8.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[3] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.4.1.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[4] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.4.44.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.user_profile.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[5] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.4.7.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
</details>
        